---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFC.IExporterIFC
source: html/aa977ac7-3128-3a06-40cf-2ee1e6db3333.htm
---
# IExporterIFC Methods

The method that Revit will invoke to perform an export to IFC.